class AllPosts {
  String post;
  String pictures;
  String comment;
  String chapter;

  AllPosts(this.post, this.pictures, this.comment, this.chapter);
}

final List<AllPosts> all = <AllPosts>[
  AllPosts("В Малмыже сейчас холодно, от плюс 7 до плюс 9 градусов \"тепла\"",
      "assets/malmig.jpg", "Какой-то комментарий от кого-то", "малмыж"),
  AllPosts("Продам чонибудь за скольнибудь. Крассивая вещица чо, берите,"
      " не пожалеете! Всего 100 рублей!", "assets/reklama.jpg",
      "Какой-то комментарий от кого-то", "реклама"),
  AllPosts("На окраинах вселенной происходит вот что. Обезьяны снова захватили"
      " термобарическую станцию и жуют бананы. Но это ничего не значит.",
      "assets/krugozor.jpg", "Какой-то комментарий от кого-то", "кругозор"),
  AllPosts("В Малмыже сейчас холодно, от плюс 7 до плюс 9 градусов \"тепла\"",
      "assets/malmig.jpg", "Какой-то комментарий от кого-то", "малмыж"),
  AllPosts("Продам чонибудь за скольнибудь. Крассивая вещица чо, берите,"
      " не пожалеете! Всего 100 рублей!", "assets/reklama.jpg",
      "Какой-то комментарий от кого-то", "реклама"),
  AllPosts("На окраинах вселенной происходит вот что. Обезьяны снова захватили"
      " термобарическую станцию и жуют бананы. Но это ничего не значит.",
      "assets/krugozor.jpg", "Какой-то комментарий от кого-то", "кругозор"),
  AllPosts("В Малмыже сейчас холодно, от плюс 7 до плюс 9 градусов \"тепла\"",
      "assets/malmig.jpg", "Какой-то комментарий от кого-то", "малмыж"),
  AllPosts("Продам чонибудь за скольнибудь. Крассивая вещица чо, берите,"
      " не пожалеете! Всего 100 рублей!", "assets/reklama.jpg",
      "Какой-то комментарий от кого-то", "реклама"),
  AllPosts("На окраинах вселенной происходит вот что. Обезьяны снова захватили"
      " термобарическую станцию и жуют бананы. Но это ничего не значит.",
      "assets/krugozor.jpg", "Какой-то комментарий от кого-то", "кругозор"),
  AllPosts("В Малмыже сейчас холодно, от плюс 7 до плюс 9 градусов \"тепла\"",
      "assets/malmig.jpg", "Какой-то комментарий от кого-то", "малмыж"),
  AllPosts("Продам чонибудь за скольнибудь. Крассивая вещица чо, берите,"
      " не пожалеете! Всего 100 рублей!", "assets/reklama.jpg",
      "Какой-то комментарий от кого-то", "реклама"),
  AllPosts("На окраинах вселенной происходит вот что. Обезьяны снова захватили"
      " термобарическую станцию и жуют бананы. Но это ничего не значит.",
      "assets/krugozor.jpg", "Какой-то комментарий от кого-то", "кругозор"),
];
