class Krugozor {
  String post;
  String pictures;
  String comment;
  String chapter;

  Krugozor(this.post, this.pictures, this.comment, this.chapter);
}

final List<Krugozor> krugozor = <Krugozor>[
  Krugozor(
      "На окраинах вселенной происходит вот что. Обезьяны снова захватили"
          " термобарическую станцию и жуют бананы. Но это ничего не значит.",
      "assets/krugozor.jpg",
      "Какой-то комментарий от кого-то",
      "кругозор"),
  Krugozor(
      "На окраинах вселенной происходит вот что. Обезьяны снова захватили"
          " термобарическую станцию и жуют бананы. Но это ничего не значит.",
      "assets/krugozor.jpg",
      "Какой-то комментарий от кого-то",
      "кругозор"),
  Krugozor(
      "На окраинах вселенной происходит вот что. Обезьяны снова захватили"
          " термобарическую станцию и жуют бананы. Но это ничего не значит.",
      "assets/krugozor.jpg",
      "Какой-то комментарий от кого-то",
      "кругозор"),
  Krugozor(
      "На окраинах вселенной происходит вот что. Обезьяны снова захватили"
          " термобарическую станцию и жуют бананы. Но это ничего не значит.",
      "assets/krugozor.jpg",
      "Какой-то комментарий от кого-то",
      "кругозор"),
  Krugozor(
      "На окраинах вселенной происходит вот что. Обезьяны снова захватили"
          " термобарическую станцию и жуют бананы. Но это ничего не значит.",
      "assets/krugozor.jpg",
      "Какой-то комментарий от кого-то",
      "кругозор"),
  Krugozor(
      "На окраинах вселенной происходит вот что. Обезьяны снова захватили"
          " термобарическую станцию и жуют бананы. Но это ничего не значит.",
      "assets/krugozor.jpg",
      "Какой-то комментарий от кого-то",
      "кругозор"),
  Krugozor(
      "На окраинах вселенной происходит вот что. Обезьяны снова захватили"
          " термобарическую станцию и жуют бананы. Но это ничего не значит.",
      "assets/krugozor.jpg",
      "Какой-то комментарий от кого-то",
      "кругозор"),
  Krugozor(
      "На окраинах вселенной происходит вот что. Обезьяны снова захватили"
          " термобарическую станцию и жуют бананы. Но это ничего не значит.",
      "assets/krugozor.jpg",
      "Какой-то комментарий от кого-то",
      "кругозор"),
  Krugozor(
      "На окраинах вселенной происходит вот что. Обезьяны снова захватили"
          " термобарическую станцию и жуют бананы. Но это ничего не значит.",
      "assets/krugozor.jpg",
      "Какой-то комментарий от кого-то",
      "кругозор"),
  Krugozor(
      "На окраинах вселенной происходит вот что. Обезьяны снова захватили"
          " термобарическую станцию и жуют бананы. Но это ничего не значит.",
      "assets/krugozor.jpg",
      "Какой-то комментарий от кого-то",
      "кругозор"),
  Krugozor(
      "На окраинах вселенной происходит вот что. Обезьяны снова захватили"
          " термобарическую станцию и жуют бананы. Но это ничего не значит.",
      "assets/krugozor.jpg",
      "Какой-то комментарий от кого-то",
      "кругозор"),
  Krugozor(
      "На окраинах вселенной происходит вот что. Обезьяны снова захватили"
          " термобарическую станцию и жуют бананы. Но это ничего не значит.",
      "assets/krugozor.jpg",
      "Какой-то комментарий от кого-то",
      "кругозор"),
];
