import 'package:flutter/material.dart';

void main() => runApp(const MyApp());

class MyApp extends StatelessWidget {
  const MyApp({super.key});

  static const String _title = 'Малмыж Инфо';

  @override
  Widget build(BuildContext context) {
    return MaterialApp(
      title: _title,
      theme: ThemeData(
          brightness: Brightness.dark,
          primaryColor: Colors.lightBlue[800],
          fontFamily: 'Roboto'),
      home: DefaultTabController(
        length: 4,
        child: Scaffold(
          body: NestedScrollView(
            headerSliverBuilder:
                (BuildContext context, bool innerBoxIsScrolled) {
              return <Widget>[
                SliverAppBar(
                  pinned: true,
                  floating: true,
                  leading: IconButton(
                    icon: const Icon(Icons.menu),
                    onPressed: () {},
                  ),
                  centerTitle: true,
                  title: Column(
                    children: const [
                      FittedBox(
                        fit: BoxFit.fitWidth,
                        child: Text(
                          'Малмыж Инфо',
                        ),
                      ),
                      FittedBox(
                        fit: BoxFit.fitWidth,
                        child: Text(
                          'Информационный вестник Малмыжа',
                        ),
                      ),
                    ],
                  ),
                  actions: [
                    PopupMenuButton<Text>(
                      itemBuilder: (context) {
                        return [
                          const PopupMenuItem(
                            child: Text(
                              'Войти',
                            ),
                          ),
                          const PopupMenuItem(
                            child: Text(
                              'Чат Малмыжа',
                            ),
                          ),
                          const PopupMenuItem(
                            child: Text(
                              'Избранное',
                            ),
                          ),
                        ];
                      },
                    ),
                  ],
                  bottom: const TabBar(
                    indicatorWeight: 0,
                    indicator: BoxDecoration(color: Colors.black87),
                    indicatorSize: TabBarIndicatorSize.tab,
                    labelPadding: EdgeInsets.symmetric(horizontal: 5),
                    isScrollable: true,
                    tabs: [
                      Tab(text: 'Вся лента'),
                      Tab(text: 'Малмыж'),
                      Tab(text: 'Объявления'),
                      Tab(text: 'Кругозор'),
                    ],
                  ),
                ),
              ];
            },
            body: const TabBarView(
              children: [
                Center(
                    child:
                        Text("Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций"
                            "Все новости в куче в порядке времени публикаций")),
                Center(
                    child: Text(
                        "Здесь только новости Малмыжа с тегом #НовостиМалмыжа")),
                Center(
                    child:
                        Text("Здесь только посты с рекламными объявлениями")),
                Center(
                    child: Text(
                        "Здесь только новости науки и общества для развития кругозора"))
              ],
            ),
          ),
        ),
      ),
    );
  }
}
