class Malmig {
  String post;
  String pictures;
  String comment;
  String chapter;

  Malmig(this.post, this.pictures, this.comment, this.chapter);
}

final List<Malmig> malmig = <Malmig>[
  Malmig("В Малмыже сейчас холодно, от плюс 7 до плюс 9 градусов \"тепла\"",
      "assets/malmig.jpg", "Какой-то комментарий от кого-то", "малмыж"),
  Malmig("В Малмыже сейчас холодно, от плюс 7 до плюс 9 градусов \"тепла\"",
      "assets/malmig.jpg", "Какой-то комментарий от кого-то", "малмыж"),
  Malmig("В Малмыже сейчас холодно, от плюс 7 до плюс 9 градусов \"тепла\"",
      "assets/malmig.jpg", "Какой-то комментарий от кого-то", "малмыж"),
  Malmig("В Малмыже сейчас холодно, от плюс 7 до плюс 9 градусов \"тепла\"",
      "assets/malmig.jpg", "Какой-то комментарий от кого-то", "малмыж"),
  Malmig("В Малмыже сейчас холодно, от плюс 7 до плюс 9 градусов \"тепла\"",
      "assets/malmig.jpg", "Какой-то комментарий от кого-то", "малмыж"),
  Malmig("В Малмыже сейчас холодно, от плюс 7 до плюс 9 градусов \"тепла\"",
      "assets/malmig.jpg", "Какой-то комментарий от кого-то", "малмыж"),
  Malmig("В Малмыже сейчас холодно, от плюс 7 до плюс 9 градусов \"тепла\"",
      "assets/malmig.jpg", "Какой-то комментарий от кого-то", "малмыж"),
  Malmig("В Малмыже сейчас холодно, от плюс 7 до плюс 9 градусов \"тепла\"",
      "assets/malmig.jpg", "Какой-то комментарий от кого-то", "малмыж"),
  Malmig("В Малмыже сейчас холодно, от плюс 7 до плюс 9 градусов \"тепла\"",
      "assets/malmig.jpg", "Какой-то комментарий от кого-то", "малмыж"),
  Malmig("В Малмыже сейчас холодно, от плюс 7 до плюс 9 градусов \"тепла\"",
      "assets/malmig.jpg", "Какой-то комментарий от кого-то", "малмыж"),
  Malmig("В Малмыже сейчас холодно, от плюс 7 до плюс 9 градусов \"тепла\"",
      "assets/malmig.jpg", "Какой-то комментарий от кого-то", "малмыж"),
  Malmig("В Малмыже сейчас холодно, от плюс 7 до плюс 9 градусов \"тепла\"",
      "assets/malmig.jpg", "Какой-то комментарий от кого-то", "малмыж"),
  Malmig("В Малмыже сейчас холодно, от плюс 7 до плюс 9 градусов \"тепла\"",
      "assets/malmig.jpg", "Какой-то комментарий от кого-то", "малмыж"),
  Malmig("В Малмыже сейчас холодно, от плюс 7 до плюс 9 градусов \"тепла\"",
      "assets/malmig.jpg", "Какой-то комментарий от кого-то", "малмыж"),
  Malmig("В Малмыже сейчас холодно, от плюс 7 до плюс 9 градусов \"тепла\"",
      "assets/malmig.jpg", "Какой-то комментарий от кого-то", "малмыж")
];
