class Reklama {
  String post;
  String pictures;
  String comment;
  String chapter;

  Reklama(this.post, this.pictures, this.comment, this.chapter);
}

final List<Reklama> reklama = <Reklama>[
  Reklama(
      "Продам чонибудь за скольнибудь. Крассивая вещица чо, берите,"
          " не пожалеете! Всего 100 рублей!",
      "assets/reklama.jpg",
      "Какой-то комментарий от кого-то",
      "реклама"),
  Reklama(
      "Продам чонибудь за скольнибудь. Крассивая вещица чо, берите,"
          " не пожалеете! Всего 100 рублей!",
      "assets/reklama.jpg",
      "Какой-то комментарий от кого-то",
      "реклама"),
  Reklama(
      "Продам чонибудь за скольнибудь. Крассивая вещица чо, берите,"
          " не пожалеете! Всего 100 рублей!",
      "assets/reklama.jpg",
      "Какой-то комментарий от кого-то",
      "реклама"),
  Reklama(
      "Продам чонибудь за скольнибудь. Крассивая вещица чо, берите,"
          " не пожалеете! Всего 100 рублей!",
      "assets/reklama.jpg",
      "Какой-то комментарий от кого-то",
      "реклама"),
  Reklama(
      "Продам чонибудь за скольнибудь. Крассивая вещица чо, берите,"
          " не пожалеете! Всего 100 рублей!",
      "assets/reklama.jpg",
      "Какой-то комментарий от кого-то",
      "реклама"),
  Reklama(
      "Продам чонибудь за скольнибудь. Крассивая вещица чо, берите,"
          " не пожалеете! Всего 100 рублей!",
      "assets/reklama.jpg",
      "Какой-то комментарий от кого-то",
      "реклама"),
  Reklama(
      "Продам чонибудь за скольнибудь. Крассивая вещица чо, берите,"
          " не пожалеете! Всего 100 рублей!",
      "assets/reklama.jpg",
      "Какой-то комментарий от кого-то",
      "реклама"),
  Reklama(
      "Продам чонибудь за скольнибудь. Крассивая вещица чо, берите,"
          " не пожалеете! Всего 100 рублей!",
      "assets/reklama.jpg",
      "Какой-то комментарий от кого-то",
      "реклама"),
  Reklama(
      "Продам чонибудь за скольнибудь. Крассивая вещица чо, берите,"
          " не пожалеете! Всего 100 рублей!",
      "assets/reklama.jpg",
      "Какой-то комментарий от кого-то",
      "реклама"),
  Reklama(
      "Продам чонибудь за скольнибудь. Крассивая вещица чо, берите,"
          " не пожалеете! Всего 100 рублей!",
      "assets/reklama.jpg",
      "Какой-то комментарий от кого-то",
      "реклама"),
  Reklama(
      "Продам чонибудь за скольнибудь. Крассивая вещица чо, берите,"
          " не пожалеете! Всего 100 рублей!",
      "assets/reklama.jpg",
      "Какой-то комментарий от кого-то",
      "реклама"),
  Reklama(
      "Продам чонибудь за скольнибудь. Крассивая вещица чо, берите,"
          " не пожалеете! Всего 100 рублей!",
      "assets/reklama.jpg",
      "Какой-то комментарий от кого-то",
      "реклама"),
];
